@extends('layouts.dashboard') @section('title', 'Зээлийн гэрээ') @section('content')
<div class="col-md-12">
    <page class="a4">
        <div class="row">
                <div id="printer" class="preview">
                    <p class="font-weight-bold text-uppercase text-center">Зээлийн гэрээ</p>
                    <span class="print">{{ $loan->created_at->format('Y-m-d h:m') }}</span>
                    <span class='pull-right float-right'>{{ $loan->location }}</span>
                    <p class='text-center'>Дугаар: {{$loan->id}}</p>
                    <br>
                    <p >Энэхүү гэрээг нэг талаас Зээл өгөгч
                        {{ $loan->city }} хотын (аймгийн)
                        {{ $loan->district }} дүүргийн (сумын)
                        {{ $loan->khoroo }} хорооны (багийн)
                        {{ $loan->user_regnumber }} тоот иргэний үнэмлэхтэй
                        {{ $loan->lastname }} -ийн
                        {{ $loan->firstname }} , нөгөө талаас Зээл авагч
                        {{ $loan->city1 }} хотын (аймгийн)
                        {{ $loan->district1 }} дүүргийн (сумын)
                        {{ $loan->khoroo1 }} хорооны (багийн)
                        {{ $loan->user_regnumber1 }} тоот иргэний үнэмлэхтэй
                        {{ $loan->lastname1 }} -ийн
                        {{ $loan->firstname1 }} нар харилцан тохиролцож, Монгол улсын Иргэний хуулийн 281-285 дугаар зүйлүүдийг үндэслэн дараахь нөхцөлтэйгээр байгуулав.</p>
                    <br>
                    <p >
                        1.Зээл өгөгч нь
                        {{ $loan->price1 }} (төгрөг, доллар, юань, рубль, евро) -г
                        {{ $loan->date1 }} зээл авагчид
                        {{ $loan->date2 }} хүртэл
                        {{ $loan->date3 }} хугацаатайгаар зээлдүүлж байна.</p>
                    <p >2. Зээл авагч нь авсан зээл болох
                        {{ $loan->price2 }} (төгрөг, доллар, юань, рубль, евро)-д
                        {{ $loan->date2 }} ( сар, жил ) бүр
                        {{ $loan->hvv }} хувийн хүү төлнө.</p>
                    <p >3. Энэхүү гэрээний үүргийн гүйцэтгэлийг хангахын тулд барьцааны зүйл болгон
                        {{ $loan->baritsaa }} эд хөрөнгийг барьцаанд авав. ( барьцааны эд хөрөнгийн жагсаалтыг хавсаргав. Хавсралт нь энэ гэрээний салшгүй хэсэг болно) Жич: энэ хэсгийг зөвхөн барьцаатай зээлийн гэрээнд хэрэглэнэ.</p>
                    <p >4. Зээл авагч тал энэ гэрээнд заасан хугацаанд авсан зээлээ, хүүгийн хамт төлөх үүрэгтэй.</p>
                    <p >5. Гэрээнд заасан хугацаанд зээлийг хүүгийн хамт төлөөгүй тохиолдолд хугацаа хэтэрсэн хоног тутамд төлөөгүй үлдсэн мөнгөний үнийн дүнгийн
                        {{ $loan->percent }} хувиар бодож алдангийг зээл өгөгчид төлөх үүрэгтэй.</p>
                    <p >6. Зээл авагч тал хугацаандаа авсан зээлээ буцаан төлөөгүй тохиолдолд гэрээний хугацаа дууссанаас хойш
                        {{ $loan->exday }} хоног өнгөрмөгц Зээл өгөгч нь барьцаанд авсан хөрөнгийг захиран зарцуулж, түүний үнийн дүнгээс үндсэн зээл, хүү, алданги, хохирлоо гаргаж авах эрхтэй.</p>
                    <p >7. Барьцааны эд хөрөнгийг борлуулж энэ гэрээний 6-д заасан төлбөрийг барагдуулж дуусаад мөнгө үлдэх тохиолдолд зээл авагчид буцаан өгөх үүргийг зээл өгөгч хүлээнэ. Барьцааны эд хөрөнгийг худалдахад зээл өгөгч хамт байхыг шаардах эрхтэй. </p>
                    <p >8. Энэ гэрээтэй холбоотой аливаа маргаантай асуудлыг Монголын Үндэсний Худалдаа Аж Үйлдвэрийн Танхимын дэргэдэх Монголын Олон Улсын ба Үндэсний Арбитрт түүний Арбитрын хэрэг хянан шийдвэрлэх дүрмийн дагуу Монгол Улсад эцэслэн шийдвэрлүүлнэ.</p>
                    <p >9. Зээл өгөгч гэрээнд заасан мөнгийг зээл авагчид шилжүүлэн өгснөөр энэхүү гэрээг байгуулсанд тооцно.</p>
                    <p >10. Гэрээг 2 хувь үйлдэж, талууд гарын үсэг зуран нэг нэг хувийг хадгална.</p>
                    <br>
                    <p class="text-center">Гэрээний тал:</p>
                    <p class="font-weight-bold">Зээл өгөгч:</p>
                    <p >Эцэг/эх/-ийн нэр: 
                        {{ $loan->lastname2 }} нэр:
                        {{ $loan->firstname2 }} оршин суугаа хаяг: 
                        {{ $loan->location1 }} утас: 
                        {{ $loan->phone_numbers }} иргэний үнэмлэхийн дугаар: 
                        {{ $loan->password_number }} регистрийн дугаар: 
                        {{ $loan->regnumber2 }} Банкны харилцах данс: 
                        {{ $loan->bankaccount }} Гарын үсэг___________________</p>
                    <p class="font-weight-bold">Зээл авагч:</p>
                    <p >Эцэг/эх/-ийн нэр: 
                        {{ $loan->lastname3 }} нэр: 
                        {{ $loan->firstname3 }} оршин суугаа хаяг: 
                        {{ $loan->location2 }} утас: 
                        {{ $loan->phone_numbers2 }} иргэний үнэмлэхийн дугаар: 
                        {{ $loan->passwordnumber2 }} регистрийн дугаар: 
                        {{ $loan->reg_number3 }} Банкны харилцах данс: 
                        {{ $loan->bankaccount2 }} Гарын үсэг___________________</p>
                </div>
                </br>
                <div class="w-100">
                <button id="print_button" class="btn btn-default float-left">Хэвлэх</button>
                <div class="float-right" style="line-height: 58px;">
                        {!! $loan->status == 1 
                                   ? '<span class="badge text-warning" data-toggle="tooltip" data-placement="bottom" title="" style="font-size:12px;" data-original-title="Төлөх дүн:'.$loan->price.'">Төлбөр төлөх шаардлагатай</span>'
                                   : "<span class='badge text-success'>Баталгаажсан</span>"
                        !!}
                <div>
                <div>
        </div>
    </page>
</div>
<script>
$('#print_button').click(function(){
		$( '#printer' ).print( {
			mediaPrint: false,
			title: 'Зээлийн гэрээ #{{$loan->id}}',
		});
});
</script>
@endsection